org/dp.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Decision Procedure</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-12-22 18:21:39 CST"/>
<meta name="author" content="S.M.Yang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="base.css">


</head>
<body>
<div id="content">

<h1 class="title">Decision Procedure</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction and Basic Concepts </a>
<ul>
<li><a href="#sec-1_1">1.1 Two Approaches to Formal Reasoning </a></li>
<li><a href="#sec-1_2">1.2 Normal Forms </a></li>
</ul>
</li>
<li><a href="#sec-2">2 Decision Procedures for Propositional Logic </a>
<ul>
<li><a href="#sec-2_1">2.1 Propsitional Logic </a></li>
<li><a href="#sec-2_2">2.2 DPLL framework </a>
<ul>
<li><a href="#sec-2_2_1">2.2.1 State of a clause under an assignment </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction and Basic Concepts </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1"><span class="section-number-3">1.1</span> Two Approaches to Formal Reasoning </h3>
<div class="outline-text-3" id="text-1_1">

<ol>
<li>
Deduction
</li>
<li>
Enumeration
</li>
</ol>

</div>

</div>

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2"><span class="section-number-3">1.2</span> Normal Forms </h3>
<div class="outline-text-3" id="text-1_2">

<ol>
<li>
NNF
<ol>
<li>
Negation Normal Form
</li>
<li>
<b>Monotonicity</b>. Increasing a satisfied literal set maintains satisfiability
</li>
<li>
Every quantifier-free formula with a Boolean structure can be transformed in linear time to NNF
</li>
</ol>
</li>
<li>
DNF
<ol>
<li>
Disjunctive Normal Form
</li>
<li>
\/(/\&hellip;)
</li>
<li>
Semantic case-splitting
</li>
</ol>
</li>
<li>
CNF
<ol>
<li>
Conjunctive Normal Form
</li>
<li>
Every formula with a Boolean structure can be transformed into an equivalent
CNF formula, while potentially increasing the size of the formula exponentially.
Yet, any propositional formula can also be transformed into an
equisatisfiable CNF formula with only a linear increase in the size of the formula.
The price to be paid is n new Boolean variables, where n is the number
of logical gates in the formula. This transformation is done via Tseitin's
encoding(On the complexity of proofs in propositional logics).
</li>
</ol>
</li>
<li>
Theoretic Point of View
<ol>
<li>
First-order Logic
<ol>
<li>
Predicate Logic
</li>
<li>
Interpretation
</li>
<li>
Presburger arithmetic &amp; Peano arithmetic (multiply)
</li>
</ol>
</li>
<li>
Expressiveness &amp; Decidability
</li>
</ol>
</li>
</ol>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Decision Procedures for Propositional Logic </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3">2.1</span> Propsitional Logic </h3>
<div class="outline-text-3" id="text-2_1">

<p>formula : formula /\ formula | ~formula | (formula) | atom
</p>
<p>
atom : Boolean-identifier | true | false
</p></div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2"><span class="section-number-3">2.2</span> DPLL framework </h3>
<div class="outline-text-3" id="text-2_2">


</div>

<div id="outline-container-2_2_1" class="outline-4">
<h4 id="sec-2_2_1"><span class="section-number-4">2.2.1</span> State of a clause under an assignment </h4>
<div class="outline-text-4" id="text-2_2_1">

<ol>
<li>
<b>satisfied</b> if one or more of its literals are satisfied
</li>
<li>
<b>conflicting</b> if all of its literals are assigned but not satisfied
</li>
<li>
<b>unit</b> if it is not satisfied and all but one of its literals are assigned
</li>
<li>
<b>unresolved</b> otherwise

</li>
</ol>






</div>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: S.M.Yang
</p>
<p class="date"> Date: 2010-12-22 18:21:39 CST</p>
<p class="creator">HTML generated by org-mode 7.4 in emacs 24</p>
</div>
</div>
</body>
</html>
